%παράδειγμα 1,8 .Κανονικοποίηση Δεδομένων (a)


data5 =[-0.3999 -0.2625 -1.0106; 0.6900 0.2576 0.6145; 0.8156 -1.0565 0.5077; 0.7119 -0.2625 -0.0708; 0.4376 -0.8051 0.5913; 0.6686 0.5287 -0.6436; 1.1908 0.2193 0.3803; 0.4376 -0.9219 -1.0091; -0.0198 -0.2625 -0.0195; -0.1567 -0.0592 -0.0482];

figure(6)
plot(data5)
title('Initial data');

figure(7)
data5_LT=LinearTransform(data5);
subplot(2,1,1);
plot(data5_LT)
title('Linear Transform');

subplot(2,1,2);
data5_z=zscoreTransform(data5);
plot(data5_z)
title('z-score Transform');

%Με τη LinearTransform αντιστοιχίζουμε τις αριθμητικές τιμες του παραδείγματοςμε άλλες, 
%οι οποίες κυμαίνονται εντός μιας προκαθορισμένης περιοχής τιμών ( min = 0 , max = 1).
%Διατηρείται η αναλογία που υπήρχε στα αρχικά δεδομένα.
%Με την οριοθετημένη περιοχή θα έχουμε μικρότερες τυποποιημένες αποκλίσεις
%με τις οποίες μπορούμε να κατστείλουμε τα outliers.

%H z-score μετασχηματίζει γραμμικά τα δεδομένα με τέτοιο τρόπο ώστε η μέση τιμή 
%των μετασχηματισμένων δεδομένων να είναι 0 ενώ η τυπική απόκλιση είναι ίση με 1.
%Οι ίδιες οι μετασχηματισμένες τιμές δεν βρίσκονται σε ένα συγκεκριμένο διάστημα όπως [0,1]

%Διαφορά στα γραφήματα δεν υπάρχει.



%παράδειγμα 1,8 .Κανονικοποίηση Δεδομένων (b)

for i=1:4
    data6=iris(:,i);
    figure(7+i);
    subplot(3,1,1);
    plot(data6);
    title('Initial data');
   
    subplot(3,1,2);
    data_LT=LinearTransform(data6);
    plot(data_LT)
    title('Linear Transform');

    subplot(3,1,3);
    data_z=zscoreTransform(data6);
    plot(data_z)
    title('z-score Transform');
end

%Όπως και παραπάνω διαφορά στα γραφήματα μεταξύ min-max και z-score δεν παρατηρήθηκε 